In [1]:
#!pip install pymysql
#!pip install sqlalchemy

In [2]:
import pandas as pd
import numpy as np

import pymysql                        # for getting data from a SQL database
from sqlalchemy import create_engine  # for establishing the connection and authentication

from getpass import getpass  # To get the password without showing the input

In [3]:
password = getpass()

········

In [4]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [5]:
type(engine)

sqlalchemy.engine.base.Engine

In [6]:
data = pd.read_sql_query('SELECT * FROM sakila.actor', engine)# this helps 'select statements'
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

# 1.How many distinct (different) actors' last names are there?

In [7]:
#How many distinct (different) actors' last names are there?
actor_name =pd.read_sql_query('SELECT count(DISTINCT last_name) FROM sakila.actor', engine)

In [8]:
actor_name.head()

   count(DISTINCT last_name)
0                        121

In [9]:
#Or
actor_name = '''SELECT count( DISTINCT last_name) FROM sakila.actor;'''

print(actor_name)
data = pd.read_sql_query(actor_name, engine)
data

SELECT count( DISTINCT last_name) FROM sakila.actor;

   count( DISTINCT last_name)
0                         121

# 2.Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week

In [14]:
#2
days = '''SELECT *, 
CASE 
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sat' then 'Weekend'
WHEN DATE_FORMAT(rental_date,'%%a') = 'Sun' then 'Weekend'
ELSE 'Weekday'
END AS day_type
from rental;'''
data2 = pd.read_sql_query(days, engine)
data2.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Weekday

# 3. Get all films with ARMAGEDDON in the title.

In [15]:
#3 GET FILMS WITH ARMAGEDDONAS TILE
title_amag = '''SELECT title FROM sakila.film WHERE title LIKE '%%ARMAGEDDON%%';'''

data3 = pd.read_sql_query(title_amag, engine)
data3

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

# 4.Get 10 the longest films.

In [16]:
#question 4
query = '''SELECT title, length FROM sakila.film ORDER BY length DESC LIMIT 10;'''

data4 = pd.read_sql_query(query, engine)
data4.head()

            title  length
0  DARN FORRESTER     185
1    POND SEATTLE     185
2   CHICAGO NORTH     185
3   MUSCLE BRIGHT     185
4    WORST BANGER     185

# 5.How many films include Behind the Scenes content?

In [17]:
special_features = '''SELECT count(title) FROM  sakila.film
WHERE special_features LIKE "%%behind the scene%%";'''

data5 = pd.read_sql_query(special_features, engine)
data5.head()

   count(title)
0           538

# 6.Which kind of movies (rating) have a mean duration of more than two hours?

In [18]:
#6.
query = '''SELECT Rating, AVG(Length) AS Mean_Length FROM sakila.film GROUP BY Rating HAVING Mean_Length > 120'''

data = pd.read_sql_query(query, engine)
data.head()

  Rating  Mean_Length
0  PG-13     120.4439

# 7.Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank

In [19]:
#7
query = '''SELECT Title, Length, RANK() OVER (ORDER BY Length DESC) AS 'Rank' FROM sakila.film WHERE Length IS NOT NULL AND Length > 0;'''
data = pd.read_sql_query(query, engine)
data

                   Title  Length  Rank
0          CHICAGO NORTH     185     1
1         CONTROL ANTHEM     185     1
2         DARN FORRESTER     185     1
3            GANGS PRIDE     185     1
4              HOME PITY     185     1
..                   ...     ...   ...
995         ALIEN CENTER      46   996
996            IRON MOON      46   996
997        KWAI HOMEWARD      46   996
998     LABYRINTH LEAGUE      46   996
999  RIDGEMONT SUBMARINE      46   996

[1000 rows x 3 columns]